RuanJG/stm32App/source/app/app_CSWL_LED_Monitor.c
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12 | GPIO_Pin_0; 
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;//GPIO_Mode_IN_FLOATING; 
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; 
	GPIO_Init(GPIOA, &GPIO_InitStructure); 
	
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2,ENABLE);	
	capture_counter_timer_init(TIM2);

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1,ENABLE);
	capture_counter_timer_init(TIM1);
	
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3,ENABLE);
	cpature_counter_reset_interval(capture_time_ms);
	
	NVIC_InitStructure.NVIC_IRQChannel                        = TIM3_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority      = 0;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority             = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd                     = ENABLE;
	NVIC_Init(&NVIC_InitStructure);	
	
	
	// Enable the Interrupt
	NVIC_InitStructure.NVIC_IRQChannel                        = TIM1_UP_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority      = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority             = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd                     = ENABLE;
	NVIC_Init(&NVIC_InitStructure);	
	
	NVIC_InitStructure.NVIC_IRQChannel                        = TIM2_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority      = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority             = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd                     = ENABLE;
	NVIC_Init(&NVIC_InitStructure);	
	
}

void TIM2_IRQHandler(void)
{
	if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET) 
	{
		TIM_ClearITPendingBit(TIM2, TIM_IT_Update );
		capture_1to6_periods++;
	}
}

void TIM1_UP_IRQHandler()
{
	if (TIM_GetITStatus(TIM1, TIM_IT_Update) != RESET) 
	{
		TIM_ClearITPendingBit(TIM1, TIM_IT_Update );
		capture_7to12_periods++;
	}
}


void TIM3_IRQHandler(void)
{
	if (TIM_GetITStatus(TIM3, TIM_IT_Update) != RESET) 
	{
		
		TIM_Cmd(TIM2, DISABLE);
		TIM_Cmd(TIM1, DISABLE);
		
		capture_1to6_tickers = TIM_GetCounter(TIM2);
		capture_7to12_tickers = TIM_GetCounter(TIM1); 
		capture_1to6_tickers += ( capture_1to6_periods * capture_timer_period );
		capture_7to12_tickers += ( capture_7to12_periods * capture_timer_period );
		capture_counter_status = CAPTURE_FINISH;
		
		TIM_ClearITPendingBit(TIM3, TIM_IT_Update );
		TIM_Cmd(TIM3, DISABLE);
	}
	
}


void capture_counter_stop()
{
	TIM_Cmd(TIM3, DISABLE);
	TIM_Cmd(TIM2, DISABLE);
	TIM_Cmd(TIM1, DISABLE);
	capture_counter_status = CAPTURE_IDEL;
}

void capture_counter_start()
{
	capture_counter_stop();
	
	capture_1to6_tickers = 0;
	capture_1to6_periods = 0;
	capture_7to12_tickers = 0;
	capture_7to12_periods = 0;
	capture_counter_status = CAPTURE_STARTED;
	
	TIM_SetCounter(TIM2, 0);
	TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
	TIM_Cmd(TIM2, ENABLE);
	
	TIM_SetCounter(TIM1, 0);
	TIM_ClearITPendingBit(TIM1, TIM_IT_Update);
	TIM_Cmd(TIM1, ENABLE);
	
	TIM_SetCounter(TIM3, 0);
	TIM_ClearITPendingBit(TIM3, TIM_IT_Update);
	TIM_Cmd(TIM3, ENABLE);
}

int capture_counter_check(int *freq1_6, int *freq_7_12)
{
	if( capture_counter_status == CAPTURE_FINISH )
	{
		*freq1_6 = capture_1to6_tickers *1000 / capture_time_ms ;// HZ
		*freq_7_12 = capture_7to12_tickers *1000 / capture_time_ms ;// HZ
		capture_counter_stop();
		return 1;
	}
	return 0;
}








typedef enum _LED_ID {
	LED1 = 0,
	LED2,LED3,LED4,LED5,LED6,LED7,LED8,LED9,LED10,LED11,LED12	
}LED_ID_Type;

volatile unsigned char led_regs[12];
volatile unsigned char led_regs_feedback[12];
volatile unsigned char led_update_status;
volatile unsigned char led_current_id;

#define LED_STATUS_ENABLE			0x00
#define LED_STATUS_DISABLE		0x02
#define LED_STATUS_COLOR_RED				0x00
#define LED_STATUS_COLOR_GREEN			0x0C
#define LED_STATUS_COLOR_BLUE				0x04
#define LED_STATUS_COLOR_CLEAR				0x08
#define LED_STATUS_FREQ_100		0x30
#define LED_STATUS_FREQ_20		0x10
#define LED_STATUS_FREQ_2			0x20
#define LED_STATUS_FREQ_OFF			0x00
#define LED_STATUS_LED_ON				0x00
#define LED_STATUS_LED_OFF				0x01

#define LED_STATUS_OK  1
#define LED_STATUS_NG   0

#define LED_SERIAL_INPUT(X) GPIO_WriteBit( GPIOB, GPIO_Pin_4 , X)
#define LED_SERIAL_nEN(X)   GPIO_WriteBit( GPIOB, GPIO_Pin_5 , X)
#define LED_SERIAL_LOCK(X)  GPIO_WriteBit( GPIOB, GPIO_Pin_6 , X)
#define LED_SERIAL_CLK(X)   GPIO_WriteBit( GPIOB, GPIO_Pin_7 , X)
#define LED_SERIAL_REGCLR(X)   GPIO_WriteBit( GPIOB, GPIO_Pin_8 , X)
#define LED_SERIAL_OUTPUT() GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_3)

#define LED_HAS_SERIAL_74HC595    1  // if using the 74HC595 


void _sn74hc595_delay_nop()
{
	volatile int i=36;
	while( i-- > 0 ) __NOP();
	//systick_delay_ms(1);
}

void _sn74hc595_update_regs()
{
	int i ,index;
	unsigned char reg;
	unsigned char reg_feedback;
	
	
	for( i = LED12; i >= LED1; i-- )
	{
		reg = led_regs[i];
		reg_feedback = 0;
		for( index = 0; index < 6 ; index++)
		{
			LED_SERIAL_INPUT( (reg>>index) & 0x1 );
			LED_SERIAL_CLK(0);
		  _sn74hc595_delay_nop();
			LED_SERIAL_CLK(1);
			_sn74hc595_delay_nop();
			reg_feedback = (reg_feedback<<index) | LED_SERIAL_OUTPUT();
		}
		led_regs_feedback[LED12-i] = reg_feedback;
	}
}


/*
update the store reg
if return 0 sussefuly , -1 failed
*/
int catpure_select_update_led_status()
{
	int i,retry,res;
	
	if( 0 == LED_HAS_SERIAL_74HC595 ){
		// tsc3200 is control by hardware
		led_update_status = LED_STATUS_OK;
		return 0;
	}
	
	//clear shift reg
	LED_SERIAL_REGCLR(0);
	systick_delay_ms(1);
	LED_SERIAL_REGCLR(1);
	
	//shift data
	retry  =  4; // at less 2 times
	while( 0 < retry-- )
	{
		_sn74hc595_update_regs();
		res = 1;
		for( i = LED1; i<= LED12; i++ )
		{
			if( led_regs[i] != led_regs_feedback[i] ){
				res = 0;
				break;
			}
		}
		if( res = 1 ) break;
	}

	if( res == 1 )
	{
		//store to sotre reg
		LED_SERIAL_LOCK(0);
		_sn74hc595_delay_nop();
		LED_SERIAL_LOCK(1);
		// enable output
		LED_SERIAL_nEN(0); 
		
		led_update_status = LED_STATUS_OK;
	}else{
		led_update_status = LED_STATUS_NG;
	}
	
	return res==1 ? 0:-1;
}

void capture_select_set_led_status(LED_ID_Type led, unsigned char status)
{
	led_regs[ led ] = status;
}


void capture_select_led_output( LED_ID_Type led )
{
	if( led >= LED1 && led <= LED6 )
	{
		GPIO_WriteBit( GPIOB, GPIO_Pin_0 , (led&0x1) );
		GPIO_WriteBit( GPIOB, GPIO_Pin_1 , (led&0x2)>>1 );
		GPIO_WriteBit( GPIOB, GPIO_Pin_2 , (led&0x4)>>2 );
	}else if ( led >= LED7 && led <= LED12 ){
		led -= 6 ;
		GPIO_WriteBit( GPIOA, GPIO_Pin_8 , (led&0x1) );
		GPIO_WriteBit( GPIOA, GPIO_Pin_7 , (led&0x2)>>1 );
		GPIO_WriteBit( GPIOA, GPIO_Pin_6 , (led&0x4)>>2 );
	}
}

