RuanJG/stm32App/source/app/app_CSWL_LED_Monitor.c
//select led output and update the control pin of that tsc3200; successfully return 0, falied -1
int capture_select_led( LED_ID_Type led , unsigned char ctlparam)
{
	led_current_id = led;
	capture_select_led_output(led);
	if( ctlparam != led_regs[led] || led_update_status == LED_STATUS_NG ){
		capture_select_set_led_status(led,  ctlparam);
		return catpure_select_update_led_status();
	}
	return 0;
}

void catpure_select_init()
{
	GPIO_InitTypeDef GPIO_InitStructure;
	int i;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);

	//74h151 , output select
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_OD ;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_7 | GPIO_Pin_6;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	capture_select_led_output(LED1);
	capture_select_led_output(LED7);
	
	//74h595 , led status control 
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP ;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_3;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_IN_FLOATING ;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	LED_SERIAL_nEN(1); // high , output disabled
	LED_SERIAL_REGCLR(1); // low , shift reg clear
	LED_SERIAL_LOCK(0); // rise to triggle locking , so prepare now
	LED_SERIAL_CLK(0);
	
	for( i = LED1; i<= LED12; i++ ){
		capture_select_set_led_status( i,  LED_STATUS_ENABLE | LED_STATUS_COLOR_CLEAR | LED_STATUS_FREQ_100 | LED_STATUS_LED_OFF );
	}
	catpure_select_update_led_status();
	if ( LED_STATUS_NG ==  led_update_status){
		_LOGE("update 74hc595 reg failed\n");
	}
	
}







volatile unsigned int led_brightness[12];
volatile int auto_capture_index;
volatile int auto_capture_en;

void capture_reset_led_brightness()
{
	int i=0;
	for( i=0; i< 12; i++)
	{
		led_brightness[i] = 0;
		capture_select_set_led_status( i,  LED_STATUS_DISABLE | LED_STATUS_COLOR_CLEAR | LED_STATUS_FREQ_100 | LED_STATUS_LED_OFF );
	}
	auto_capture_index = LED1;
}


//tim 3 period , 0.1~500ms
void capture_set_interval( int ms ) 
{
	if( capture_counter_status != CAPTURE_IDEL ) {
		capture_counter_stop();
		cpature_counter_reset_interval( ms );
		capture_counter_start();
	}else{
		cpature_counter_reset_interval( ms );
	}
}

void capture_auto_mode()
{
	capture_counter_stop();
	capture_reset_led_brightness();
	auto_capture_en  = 1;
}

void capture_manual_mode()
{
	capture_counter_stop();
	auto_capture_en  = 0;
	capture_reset_led_brightness();
}

void capture_init()
{
	capture_reset_led_brightness();
	catpure_select_init();
	capture_counter_init();
	
	if ( LED_STATUS_NG ==  led_update_status){
		PC_LOGE("init 74hc595 reg failed\n");
	}
	capture_manual_mode();
}

void capture_loop()
{
	int freq1=0,freq2=0,res;
	
	if( auto_capture_en == 0) 
	{
		//manual mode  or falied select led
		if( 1 == capture_counter_check(&freq1, &freq2) )
		{
			if( led_current_id >= 0 && led_current_id< 6 ){
				led_brightness[led_current_id] = freq1;
			}else{
				led_brightness[led_current_id] = freq2;
			}
			PMSG_send_msg( PC_TAG_DATA_LED_BRIGHTNESS , (unsigned char *)led_brightness , sizeof(led_brightness) ); 
			capture_counter_start();
		}
		return;
	}
	
	//check if get bringthness
	if( 1 == capture_counter_check(&freq1, &freq2) )
	{
		led_brightness[auto_capture_index] = freq1;
		led_brightness[auto_capture_index+6] = freq2;
		capture_select_set_led_status(auto_capture_index,  led_regs[auto_capture_index]| LED_STATUS_LED_OFF );
		capture_select_set_led_status(auto_capture_index+6,  led_regs[auto_capture_index+6]| LED_STATUS_LED_OFF );
		
		if( auto_capture_index >= LED6 ){
			auto_capture_index = LED1;
			PMSG_send_msg( PC_TAG_DATA_LED_BRIGHTNESS , (unsigned char *)led_brightness , sizeof(led_brightness) ); 
		}else{
			auto_capture_index++;
		}
	}
	
	//capture_counter_check or the first time init , status = idel 
	if( capture_counter_status == CAPTURE_IDEL )
	{
		// init the tsc3200 
		res = capture_select_led(auto_capture_index , LED_STATUS_ENABLE | LED_STATUS_COLOR_CLEAR | LED_STATUS_FREQ_100 | LED_STATUS_LED_ON  ); // 1-6
		res += capture_select_led(auto_capture_index+6 , LED_STATUS_ENABLE | LED_STATUS_COLOR_CLEAR | LED_STATUS_FREQ_100 | LED_STATUS_LED_ON ); // 7-12
		if( res < 0 ) {
			// init led failed
			auto_capture_en = 0;
			PC_LOGE("init 74hc595 reg failed\n");
		}else{
			capture_counter_start();
		}
	}
}








//switchers control
#define SWITCHES_TESTMODE_ON_LEVEL 0
#define SWITCHES_TESTMODE_OFF_LEVEL 1
#define _SWITCHES_TESTMODE_S2(X) GPIO_WriteBit( GPIOB, GPIO_Pin_15 , X==1? SWITCHES_TESTMODE_ON_LEVEL:SWITCHES_TESTMODE_OFF_LEVEL)
#define _SWITCHES_TESTMODE_S3(X) GPIO_WriteBit( GPIOA, GPIO_Pin_15 , X==1? SWITCHES_TESTMODE_ON_LEVEL:SWITCHES_TESTMODE_OFF_LEVEL)
#define _SWITCHES_TESTMODE_S4(X) GPIO_WriteBit( GPIOA, GPIO_Pin_11 , X==1? SWITCHES_TESTMODE_ON_LEVEL:SWITCHES_TESTMODE_OFF_LEVEL)
#define _SWITCHES_TESTMODE_Sn(X) GPIO_WriteBit( GPIOC, GPIO_Pin_15 , X==1? SWITCHES_TESTMODE_ON_LEVEL:SWITCHES_TESTMODE_OFF_LEVEL)

void switches_testmode_S2()
{
	_SWITCHES_TESTMODE_S3(0);
	_SWITCHES_TESTMODE_S4(0);
	_SWITCHES_TESTMODE_Sn(0);
	_SWITCHES_TESTMODE_S2(1);
}
void switches_testmode_S3()
{
	_SWITCHES_TESTMODE_S4(0);
	_SWITCHES_TESTMODE_Sn(0);
	_SWITCHES_TESTMODE_S2(0);
	_SWITCHES_TESTMODE_S3(1);
}
void switches_testmode_S4()
{
	_SWITCHES_TESTMODE_S3(0);
	_SWITCHES_TESTMODE_Sn(0);
	_SWITCHES_TESTMODE_S2(0);
	_SWITCHES_TESTMODE_S4(1);
}
void switches_testmode_Sn()
{
	_SWITCHES_TESTMODE_S3(0);
	_SWITCHES_TESTMODE_S4(0);
	_SWITCHES_TESTMODE_S2(0);
	_SWITCHES_TESTMODE_Sn(1);
}

void switches_testmode_off()
{
	_SWITCHES_TESTMODE_S3(0);
	_SWITCHES_TESTMODE_S4(0);
	_SWITCHES_TESTMODE_S2(0);
	_SWITCHES_TESTMODE_Sn(0);
}


#define SWITCHES_CHANNEL_ON_LEVEL 0
#define SWITCHES_CHANNEL_OFF_LEVEL 1
#define SWITCHES_S0(X) GPIO_WriteBit( GPIOA, GPIO_Pin_1 , X==1? SWITCHES_CHANNEL_ON_LEVEL:SWITCHES_CHANNEL_OFF_LEVEL)
#define SWITCHES_S1(X) GPIO_WriteBit( GPIOA, GPIO_Pin_2 , X==1? SWITCHES_CHANNEL_ON_LEVEL:SWITCHES_CHANNEL_OFF_LEVEL)
#define SWITCHES_S2(X) GPIO_WriteBit( GPIOA, GPIO_Pin_4 , X==1? SWITCHES_CHANNEL_ON_LEVEL:SWITCHES_CHANNEL_OFF_LEVEL)
#define SWITCHES_S3(X) GPIO_WriteBit( GPIOA, GPIO_Pin_5 , X==1? SWITCHES_CHANNEL_ON_LEVEL:SWITCHES_CHANNEL_OFF_LEVEL)
#define SWITCHES_EN(X) GPIO_WriteBit( GPIOA, GPIO_Pin_3 , X==1? SWITCHES_CHANNEL_ON_LEVEL:SWITCHES_CHANNEL_OFF_LEVEL)

int switches_channel_select(int channel)
{
	if( channel > 15 )
		return -1;
	
	SWITCHES_EN(1);
	systick_delay_ms(1);
	SWITCHES_S0(((channel>>0)&0x1));
	SWITCHES_S1(((channel>>1)&0x1));
	SWITCHES_S2(((channel>>2)&0x1));
	SWITCHES_S3(((channel>>3)&0x1));
	systick_delay_ms(1);
	SWITCHES_EN(0);
	return 0;
}

void switches_channel_off()
{
	SWITCHES_EN(1);
}


