RuanJG/stm32App/source/app/app_CSWL_LED_Monitor.c
void switches_init()
{
	GPIO_InitTypeDef GPIO_InitStructure;
	int i;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC,ENABLE);

	GPIO_StructInit(&GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_15;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP ;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15 | GPIO_Pin_11 | GPIO_Pin_1| GPIO_Pin_2| GPIO_Pin_3| GPIO_Pin_4| GPIO_Pin_5;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOC, &GPIO_InitStructure);

	switches_channel_off();
	
	switches_testmode_off();

}














void cmd_even()
{
	unsigned char buffer[8];
	unsigned char i, len;
	
	len = Uart_Get(CONSOLE_UART,buffer,1);// USB_RxRead( buffer, 8 );
	
	if( len == 0 ) return;

	if( buffer[0] == 'd' ){
		debug_en = debug_en ? 0:1;
	}else if( buffer[0] == '0' ){

	}
}





void PC_msg_handler(PMSG_msg_t msg)
{
	int value,res;
	
	switch( msg.tag )
	{
		case PC_TAG_CMD_CAPTURE_EN:
			if( msg.data_len == 1 ){
				if( msg.data[0] == 0 ){
					capture_manual_mode();
				}else{
					capture_auto_mode();
				}
			}else{
				PC_LOGE("PC_TAG_CMD_CAPTURE_EN: unknow data");
			}
		break;
		
		case PC_TAG_CMD_LED_SELECT:
			capture_manual_mode();
			capture_reset_led_brightness();
			res = capture_select_led(msg.data[0]-1 , LED_STATUS_ENABLE | LED_STATUS_COLOR_CLEAR | LED_STATUS_FREQ_100 | LED_STATUS_LED_ON  );
			if( res == 0 ){
				PC_LOGI("PC_TAG_CMD_LED_SELECT: led%d start",msg.data[0]);
				capture_counter_start();
			}else{
				PC_LOGE("PC_TAG_CMD_LED_SELECT: failed");
			}
		break;
		
		case PC_TAG_CMD_CAPTURE_INTERVAL:
			if( msg.data_len == 2 ){
				value = msg.data[0] | (msg.data[1]<<8) ;
				capture_set_interval( value );
				PC_LOGI("set capture interval %dms",value);
			}else{
				PC_LOGE("PC_TAG_CMD_CAPTURE_INTERVAL:  unknow data");
			}
		break;
			
		case PC_TAG_CMD_TEST:
			//PC_LOGI("reg=0x%02x",catpure_select_test(msg.data[0]));
		break;
		
		case PC_TAG_CMD_SWITCHES_TESTMODE:
			if( msg.data_len ==1 ){
				if( msg.data[0] == 0xff ){ 
					switches_testmode_off();
					PC_LOGI("switches testmode off");
				}else{
					switch ( msg.data[0] ){
						case 2:
							switches_testmode_S2();PC_LOGI("switches testmode S2");break;
						case 3:
							switches_testmode_S3();PC_LOGI("switches testmode S3");break;
						case 4:
							switches_testmode_S4();PC_LOGI("switches testmode S4");break;
						case 5:
							switches_testmode_Sn();PC_LOGI("switches testmode Sn");break;
						default:
							PC_LOGE("PC_TAG_CMD_SWITCHES_TESTMODE:  testmode should be in [2,5]");
						break;
					}
				}
			}else{
				PC_LOGE("PC_TAG_CMD_SWITCHES_TESTMODE:  unknow data");
			}
		break;
		
		case PC_TAG_CMD_SWITCHES_CHANNEL:
			if( msg.data_len ==1 ){
				if( 0 > switches_channel_select(msg.data[0]) ){
					PC_LOGE("PC_TAG_CMD_SWITCHES_CHANNEL:  should be 0~15");
				}else{
					PC_LOGI("PC_TAG_CMD_SWITCHES_CHANNEL: channel %d ", msg.data[0]);
				}
			}else{
				PC_LOGE("PC_TAG_CMD_SWITCHES_CHANNEL:  unknow data");
			}
		break;
			
		default:
			break;
	}
	
}



void app_init()
{
	switches_init();
	Uart_USB_SWJ_init();
	PMSG_init(PC_UART, PC_msg_handler , NULL , NULL );
	capture_init();
	
	if( SystemCoreClock != 72000000 ){
		while(1);
	}
	
	PC_LOGI("Init OK");
}




volatile int led = 0;
void app_event()
{
	capture_loop();
	PMSG_even();
	cmd_even();
}

#endif //BOARD_CSWL_LED_MONITOR
